// See https://aka.ms/new-console-template for more information
Console.WriteLine("Hello, World!");

// ****************Задача 1************************
// Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.
// 3, 5 -> 243 (3⁵)
// 2, 4 -> 16
// Console.WriteLine("Введите первое число");
// int num = Convert.ToInt32(Console.ReadLine());

// Console.WriteLine("Введите второе число");
// int num1 = Convert.ToInt32(Console.ReadLine());
// int res=1;
// for (int i = 1; i <= num1; i++)
// {
//     res=res*num;
// }
// Console.WriteLine(res);

// ********************************конец*****************************
// ****************************Задача 2******************************
// Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.
// 452 -> 11
// 82 -> 10
// 9012 -> 12

// Console.WriteLine("Введите число");
// int num = Convert.ToInt32(Console.ReadLine());

// string num1 = Convert.ToString(num);
// int sum=0;
// while (num>0)
// {
//     int i=num%10;
//     sum=sum+i;
//     num=num/10; 
// }
// Console.WriteLine(sum);

// **********************конец**********************
// *******************Задача 3**********************
// Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.
// 1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19]
// 6, 1, 33 -> [6, 1, 33]

// int [] array= new int [8];
// for (int i = 0; i < array.Length; i++)
// {
//     array[i] = new Random().Next();   
// }
// Console.WriteLine(string.Join(",",array));

// ****************конец********************
